zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
          <instance name="PIOC">
            <parameters>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="PIOD">
            <parameters>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
        </module>
        <module name="PIT" id="6079" version="C">
          <instance name="PIT">
            <register-group address-space="base" name="PIT" name-in-module="PIT" offset="0xF8048030"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="PMC" id="11041" version="ZD">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0xF0014000"/>
            <signals>
              <signal pad="PC8" function="D" group="PCK" index="0"/>
              <signal pad="PD19" function="A" group="PCK" index="0"/>
              <signal pad="PD31" function="E" group="PCK" index="0"/>
              <signal pad="PB13" function="C" group="PCK" index="1"/>
              <signal pad="PB20" function="E" group="PCK" index="1"/>
              <signal pad="PC27" function="C" group="PCK" index="1"/>
              <signal pad="PD6" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="2"/>
              <signal pad="PC28" function="C" group="PCK" index="2"/>
              <signal pad="PD11" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PTC" id="44038" version="G">
          <instance name="PTC">
            <register-group address-space="base" name="PTC" name-in-module="PTC" offset="0xFC060000"/>
            <parameters>
              <param name="INSTANCE_ID" value="58"/>
              <param name="CLOCK_ID" value="58"/>
            </parameters>
            <signals>
              <signal pad="PD3" function="X1" group="PTC_X" index="0"/>
              <signal pad="PD4" function="X1" group="PTC_X" index="1"/>
              <signal pad="PD5" function="X1" group="PTC_X" index="2"/>
              <signal pad="PD6" function="X1" group="PTC_X" index="3"/>
              <signal pad="PD7" function="X1" group="PTC_X" index="4"/>
              <signal pad="PD8" function="X1" group="PTC_X" index="5"/>
              <signal pad="PD9" function="X1" group="PTC_X" index="6"/>
              <signal pad="PD10" function="X1" group="PTC_X" index="7"/>
              <signal pad="PD11" function="X1" group="PTC_Y" index="0"/>
              <signal pad="PD12" function="X1" group="PTC_Y" index="1"/>
              <signal pad="PD13" function="X1" group="PTC_Y" index="2"/>
              <signal pad="PD14" function="X1" group="PTC_Y" index="3"/>
              <signal pad="PD15" function="X1" group="PTC_Y" index="4"/>
              <signal pad="PD16" function="X1" group="PTC_Y" index="5"/>
              <signal pad="PD17" function="X1" group="PTC_Y" index="6"/>
              <signal pad="PD18" function="X1" group="PTC_Y" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" id="6343" version="ZC">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0xF802C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38"/>
              <param name="CLOCK_ID" value="38"/>
              <param name="DMAC_ID_TX" value="10"/>
              <param name="FAULT_PWM_ID0" value="0x0" caption="Fault 0 - PWM0_PWMFI0 Input pin"/>
              <param name="FAULT_PWM_ID1" value="0x1" caption="Fault 1 - PWM0_PWMFI1 Input pin"/>
              <param name="FAULT_PWM_ID2" value="0x2" caption="Fault 2 - MAIN_OSC_PMC"/>
              <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - ADC"/>
              <param name="FAULT_PWM_ID4" value="0x4" caption="Fault 4 - TIMER0"/>
              <param name="FAULT_PWM_ID5" value="0x5" caption="Fault 5 - TIMER1"/>
            </parameters>
            <signals>
              <signal pad="PB3" function="D" group="PWMEXTRG" index="1"/>
              <signal pad="PB10" function="C" group="PWMEXTRG" index="2"/>
              <signal pad="PB2" function="D" group="PWMFI" index="0"/>
              <signal pad="PB9" function="C" group="PWMFI" index="1"/>
              <signal pad="PA30" function="D" group="PWMH" index="0"/>
              <signal pad="PB0" function="D" group="PWMH" index="1"/>
              <signal pad="PB5" function="C" group="PWMH" index="2"/>
              <signal pad="PB7" function="C" group="PWMH" index="3"/>
              <signal pad="PA31" function="D" group="PWML" index="0"/>
              <signal pad="PB1" function="D" group="PWML" index="1"/>
              <signal pad="PB6" function="C" group="PWML" index="2"/>
              <signal pad="PB8" function="C" group="PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="QSPI" id="11171" version="N">
          <instance name="QSPI0">
            <register-group address-space="base" name="QSPI0" name-in-module="QSPI" offset="0xF0020000"/>
            <parameters>
              <param name="INSTANCE_ID" value="52"/>
              <param name="CLOCK_ID" value="52"/>
              <param name="DMAC_ID_TX" value="4"/>
              <param name="DMAC_ID_RX" value="5"/>
            </parameters>
            <signals>
              <signal pad="PA1" function="B" group="QSPI0_CS"/>
              <signal pad="PA15" function="C" group="QSPI0_CS"/>
              <signal pad="PA23" function="F" group="QSPI0_CS"/>
              <signal pad="PA2" function="B" group="QSPI0_IO" index="0"/>
              <signal pad="PA16" function="C" group="QSPI0_IO" index="0"/>
              <signal pad="PA24" function="F" group="QSPI0_IO" index="0"/>
              <signal pad="PA3" function="B" group="QSPI0_IO" index="1"/>
              <signal pad="PA17" function="C" group="QSPI0_IO" index="1"/>
              <signal pad="PA25" function="F" group="QSPI0_IO" index="1"/>
              <signal pad="PA4" function="B" group="QSPI0_IO" index="2"/>
              <signal pad="PA18" function="C" group="QSPI0_IO" index="2"/>
              <signal pad="PA26" function="F" group="QSPI0_IO" index="2"/>
              <signal pad="PA5" function="B" group="QSPI0_IO" index="3"/>
              <signal pad="PA19" function="C" group="QSPI0_IO" index="3"/>
              <signal pad="PA27" function="F" group="QSPI0_IO" index="3"/>
              <signal pad="PA0" function="B" group="QSPI0_SCK"/>
              <signal pad="PA14" function="C" group="QSPI0_SCK"/>
              <signal pad="PA22" function="F" group="QSPI0_SCK"/>
            </signals>
          </instance>
