zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
        <register caption="Interrupt Enable Command Register" name="AIC_IECR" offset="0x40" rw="W" size="4">
          <bitfield caption="Interrupt Enable" mask="0x00000001" name="INTEN"/>
        </register>
        <register caption="Interrupt Disable Command Register" name="AIC_IDCR" offset="0x44" rw="W" size="4">
          <bitfield caption="Interrupt Disable" mask="0x00000001" name="INTD"/>
        </register>
        <register caption="Interrupt Clear Command Register" name="AIC_ICCR" offset="0x48" rw="W" size="4">
          <bitfield caption="Interrupt Clear" mask="0x00000001" name="INTCLR"/>
        </register>
        <register caption="Interrupt Set Command Register" name="AIC_ISCR" offset="0x4C" rw="W" size="4">
          <bitfield caption="Interrupt Set" mask="0x00000001" name="INTSET"/>
        </register>
        <register caption="Debug Control Register" name="AIC_DCR" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Protection Mode" mask="0x00000001" name="PROT"/>
          <bitfield caption="General Interrupt Mask" mask="0x00000002" name="GMSK"/>
        </register>
        <register caption="Write Protection Mode Register" name="AIC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="AIC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="AIC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Priority Level" name="AIC_SMR__PRIORITY">
        <value caption="Minimum priority" name="MINIMUM" value="0x0"/>
        <value caption="Very low priority" name="VERY_LOW" value="0x1"/>
        <value caption="Low priority" name="LOW" value="0x2"/>
        <value caption="Medium priority" name="MEDIUM_LOW" value="0x3"/>
        <value caption="Medium-high priority" name="MEDIUM_HIGH" value="0x4"/>
        <value caption="High priority" name="HIGH" value="0x5"/>
        <value caption="Very high priority" name="VERY_HIGH" value="0x6"/>
        <value caption="Maximum priority" name="MAXIMUM" value="0x7"/>
      </value-group>
      <value-group caption="Interrupt Source Type" name="AIC_SMR__SRCTYPE">
        <value caption="High-level sensitive for internal source. Low-level sensitive for external source" name="INT_LEVEL_SENSITIVE" value="0x0"/>
        <value caption="Negative-edge triggered for external source" name="EXT_NEGATIVE_EDGE" value="0x1"/>
        <value caption="High-level sensitive for internal source. High-level sensitive for external source" name="EXT_HIGH_LEVEL" value="0x2"/>
        <value caption="Positive-edge triggered for external source" name="EXT_POSITIVE_EDGE" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="AIC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x414943"/>
      </value-group>
    </module>
    <module caption="AXI Matrix" id="11103" name="AXIMX" version="E">
      <register-group name="AXIMX">
        <register caption="AXI Matrix Remap Register" name="AXIMX_REMAP" offset="0x00" rw="W" size="4">
          <bitfield caption="Remap State 0" mask="0x00000001" name="REMAP0"/>
        </register>
      </register-group>
    </module>
    <module caption="Chip Identifier" id="6417" name="CHIPID" version="ZQ">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="Embedded Processor" name="CHIPID_CIDR__EPROC">
        <value caption="Cortex-M7" name="SAMx7" value="0x0"/>
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
      <value-group caption="Nonvolatile Program Memory Size" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="Second Nonvolatile Program Memory Size" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="Internal SRAM Size" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="Architecture Identifier" name="CHIPID_CIDR__ARCH">
        <value caption="SAMA5" name="SAMA5" value="0xA5"/>
      </value-group>
      <value-group caption="Nonvolatile Program Memory Type" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
