zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
        <register caption="High-End Overlay U-UV DMA Next Register" name="LCDC_HEOUNEXT" offset="0x00000378" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="UNEXT"/>
        </register>
        <register caption="High-End Overlay V DMA Head Register" name="LCDC_HEOVHEAD" offset="0x0000037C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFF" name="VHEAD"/>
        </register>
        <register caption="High-End Overlay V DMA Address Register" name="LCDC_HEOVADDR" offset="0x00000380" rw="RW" size="4">
          <bitfield caption="DMA Transfer Start Address for V Chrominance" mask="0xFFFFFFFF" name="VADDR"/>
        </register>
        <register caption="High-End Overlay V DMA Control Register" name="LCDC_HEOVCTRL" offset="0x00000384" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="VDFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="VDMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="VDSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="VADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="VDONEIEN"/>
        </register>
        <register caption="High-End Overlay V DMA Next Register" name="LCDC_HEOVNEXT" offset="0x00000388" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="VNEXT"/>
        </register>
        <register caption="High-End Overlay Configuration Register 0" name="LCDC_HEOCFG0" offset="0x0000038C" rw="RW" size="4">
          <bitfield caption="Source Interface" mask="0x00000001" name="SIF"/>
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN" values="LCDC_HEOCFG0__BLEN"/>
          <bitfield caption="AHB Burst Length for U-V Channel" mask="0x000000C0" name="BLENUV" values="LCDC_HEOCFG0__BLENUV"/>
          <bitfield caption="Defined Length Burst Only For Channel Bus Transaction" mask="0x00000100" name="DLBO"/>
          <bitfield caption="Hardware Rotation Optimization Disable" mask="0x00001000" name="ROTDIS"/>
          <bitfield caption="Hardware Rotation Lock Disable" mask="0x00002000" name="LOCKDIS"/>
        </register>
        <register caption="High-End Overlay Configuration Register 1" name="LCDC_HEOCFG1" offset="0x00000390" rw="RW" size="4">
          <bitfield caption="Color Lookup Table Mode Enable" mask="0x00000001" name="CLUTEN"/>
          <bitfield caption="YUV Color Space Enable" mask="0x00000002" name="YUVEN"/>
          <bitfield caption="RGB Mode Input Selection" mask="0x000000F0" name="RGBMODE" values="LCDC_HEOCFG1__RGBMODE"/>
          <bitfield caption="Color Lookup Table Mode Input Selection" mask="0x00000300" name="CLUTMODE" values="LCDC_HEOCFG1__CLUTMODE"/>
          <bitfield caption="YUV Mode Input Selection" mask="0x0000F000" name="YUVMODE"/>
          <bitfield caption="YUV 4:2:2 Rotation" mask="0x00010000" name="YUV422ROT"/>
          <bitfield caption="YUV 4:2:2 Swap" mask="0x00020000" name="YUV422SWP"/>
          <bitfield caption="Down Scaling Bandwidth Optimization" mask="0x00100000" name="DSCALEOPT"/>
        </register>
        <register caption="High-End Overlay Configuration Register 2" name="LCDC_HEOCFG2" offset="0x00000394" rw="RW" size="4">
          <bitfield caption="Horizontal Window Position" mask="0x000007FF" name="XPOS"/>
          <bitfield caption="Vertical Window Position" mask="0x07FF0000" name="YPOS"/>
        </register>
        <register caption="High-End Overlay Configuration Register 3" name="LCDC_HEOCFG3" offset="0x00000398" rw="RW" size="4">
          <bitfield caption="Horizontal Window Size" mask="0x000007FF" name="XSIZE"/>
          <bitfield caption="Vertical Window Size" mask="0x07FF0000" name="YSIZE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 4" name="LCDC_HEOCFG4" offset="0x0000039C" rw="RW" size="4">
          <bitfield caption="Horizontal image Size in Memory" mask="0x000007FF" name="XMEMSIZE"/>
          <bitfield caption="Vertical image Size in Memory" mask="0x07FF0000" name="YMEMSIZE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 5" name="LCDC_HEOCFG5" offset="0x000003A0" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 6" name="LCDC_HEOCFG6" offset="0x000003A4" rw="RW" size="4">
          <bitfield caption="Pixel Stride" mask="0xFFFFFFFF" name="PSTRIDE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 7" name="LCDC_HEOCFG7" offset="0x000003A8" rw="RW" size="4">
          <bitfield caption="UV Horizontal Stride" mask="0xFFFFFFFF" name="UVXSTRIDE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 8" name="LCDC_HEOCFG8" offset="0x000003AC" rw="RW" size="4">
          <bitfield caption="UV Pixel Stride" mask="0xFFFFFFFF" name="UVPSTRIDE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 9" name="LCDC_HEOCFG9" offset="0x000003B0" rw="RW" size="4">
          <bitfield caption="Blue Default" mask="0x000000FF" name="BDEF"/>
          <bitfield caption="Green Default" mask="0x0000FF00" name="GDEF"/>
          <bitfield caption="Red Default" mask="0x00FF0000" name="RDEF"/>
        </register>
        <register caption="High-End Overlay Configuration Register 10" name="LCDC_HEOCFG10" offset="0x000003B4" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key" mask="0x000000FF" name="BKEY"/>
          <bitfield caption="Green Color Component Chroma Key" mask="0x0000FF00" name="GKEY"/>
          <bitfield caption="Red Color Component Chroma Key" mask="0x00FF0000" name="RKEY"/>
        </register>
        <register caption="High-End Overlay Configuration Register 11" name="LCDC_HEOCFG11" offset="0x000003B8" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key Mask" mask="0x000000FF" name="BMASK"/>
          <bitfield caption="Green Color Component Chroma Key Mask" mask="0x0000FF00" name="GMASK"/>
          <bitfield caption="Red Color Component Chroma Key Mask" mask="0x00FF0000" name="RMASK"/>
        </register>
        <register caption="High-End Overlay Configuration Register 12" name="LCDC_HEOCFG12" offset="0x000003BC" rw="RW" size="4">
          <bitfield caption="Blender Chroma Key Enable" mask="0x00000001" name="CRKEY"/>
          <bitfield caption="Blender Inverted Blender Output Enable" mask="0x00000002" name="INV"/>
          <bitfield caption="Blender Iterated Color Enable" mask="0x00000004" name="ITER2BL"/>
          <bitfield caption="Blender Use Iterated Color" mask="0x00000008" name="ITER"/>
          <bitfield caption="Blender Reverse Alpha" mask="0x00000010" name="REVALPHA"/>
          <bitfield caption="Blender Global Alpha Enable" mask="0x00000020" name="GAEN"/>
          <bitfield caption="Blender Local Alpha Enable" mask="0x00000040" name="LAEN"/>
          <bitfield caption="Blender Overlay Layer Enable" mask="0x00000080" name="OVR"/>
          <bitfield caption="Blender DMA Layer Enable" mask="0x00000100" name="DMA"/>
          <bitfield caption="Use Replication logic to expand RGB color to 24 bits" mask="0x00000200" name="REP"/>
          <bitfield caption="Destination Chroma Keying" mask="0x00000400" name="DSTKEY"/>
          <bitfield caption="Video Priority" mask="0x00001000" name="VIDPRI"/>
          <bitfield caption="Blender Global Alpha" mask="0x00FF0000" name="GA"/>
        </register>
        <register caption="High-End Overlay Configuration Register 13" name="LCDC_HEOCFG13" offset="0x000003C0" rw="RW" size="4">
          <bitfield caption="Horizontal Scaling Factor" mask="0x00003FFF" name="XFACTOR"/>
          <bitfield caption="Vertical Scaling Factor" mask="0x3FFF0000" name="YFACTOR"/>
          <bitfield caption="Hardware Scaler Enable" mask="0x80000000" name="SCALEN"/>
        </register>
        <register caption="High-End Overlay Configuration Register 14" name="LCDC_HEOCFG14" offset="0x000003C4" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Y coefficient for Red Component 1:2:7 format" mask="0x000003FF" name="CSCRY"/>
          <bitfield caption="Color Space Conversion U coefficient for Red Component 1:2:7 format" mask="0x000FFC00" name="CSCRU"/>
          <bitfield caption="Color Space Conversion V coefficient for Red Component 1:2:7 format" mask="0x3FF00000" name="CSCRV"/>
          <bitfield caption="Color Space Conversion Offset" mask="0x40000000" name="CSCYOFF"/>
        </register>
        <register caption="High-End Overlay Configuration Register 15" name="LCDC_HEOCFG15" offset="0x000003C8" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Y coefficient for Green Component 1:2:7 format" mask="0x000003FF" name="CSCGY"/>
          <bitfield caption="Color Space Conversion U coefficient for Green Component 1:2:7 format" mask="0x000FFC00" name="CSCGU"/>
          <bitfield caption="Color Space Conversion V coefficient for Green Component 1:2:7 format" mask="0x3FF00000" name="CSCGV"/>
          <bitfield caption="Color Space Conversion Offset" mask="0x40000000" name="CSCUOFF"/>
        </register>
        <register caption="High-End Overlay Configuration Register 16" name="LCDC_HEOCFG16" offset="0x000003CC" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Y coefficient for Blue Component 1:2:7 format" mask="0x000003FF" name="CSCBY"/>
          <bitfield caption="Color Space Conversion U coefficient for Blue Component 1:2:7 format" mask="0x000FFC00" name="CSCBU"/>
          <bitfield caption="Color Space Conversion V coefficient for Blue Component 1:2:7 format" mask="0x3FF00000" name="CSCBV"/>
          <bitfield caption="Color Space Conversion Offset" mask="0x40000000" name="CSCVOFF"/>
        </register>
        <register caption="High-End Overlay Configuration Register 17" name="LCDC_HEOCFG17" offset="0x000003D0" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 0 tap 0" mask="0x000000FF" name="XPHI0COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 0 tap 1" mask="0x0000FF00" name="XPHI0COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 0 tap 2" mask="0x00FF0000" name="XPHI0COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 0 tap 3" mask="0xFF000000" name="XPHI0COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 18" name="LCDC_HEOCFG18" offset="0x000003D4" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 0 tap 4" mask="0x000000FF" name="XPHI0COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 19" name="LCDC_HEOCFG19" offset="0x000003D8" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 1 tap 0" mask="0x000000FF" name="XPHI1COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 1 tap 1" mask="0x0000FF00" name="XPHI1COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 1 tap 2" mask="0x00FF0000" name="XPHI1COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 1 tap 3" mask="0xFF000000" name="XPHI1COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 20" name="LCDC_HEOCFG20" offset="0x000003DC" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 1 tap 4" mask="0x000000FF" name="XPHI1COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 21" name="LCDC_HEOCFG21" offset="0x000003E0" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 2 tap 0" mask="0x000000FF" name="XPHI2COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 2 tap 1" mask="0x0000FF00" name="XPHI2COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 2 tap 2" mask="0x00FF0000" name="XPHI2COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 2 tap 3" mask="0xFF000000" name="XPHI2COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 22" name="LCDC_HEOCFG22" offset="0x000003E4" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 2 tap 4" mask="0x000000FF" name="XPHI2COEFF4"/>
        </register>
