zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
        <register caption="Post Processing Next Register" name="LCDC_PPNEXT" offset="0x00000568" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="NEXT"/>
        </register>
        <register caption="Post Processing Configuration Register 0" name="LCDC_PPCFG0" offset="0x0000056C" rw="RW" size="4">
          <bitfield caption="Source Interface" mask="0x00000001" name="SIF"/>
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN"/>
          <bitfield caption="Defined Length Burst Only For Channel Bus Transaction" mask="0x00000100" name="DLBO"/>
        </register>
        <register caption="Post Processing Configuration Register 1" name="LCDC_PPCFG1" offset="0x00000570" rw="RW" size="4">
          <bitfield caption="Post Processing Output Format Selection" mask="0x00000007" name="PPMODE" values="LCDC_PPCFG1__PPMODE"/>
          <bitfield caption="Color Space Conversion Luminance" mask="0x00000010" name="ITUBT601"/>
        </register>
        <register caption="Post Processing Configuration Register 2" name="LCDC_PPCFG2" offset="0x00000574" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="Post Processing Configuration Register 3" name="LCDC_PPCFG3" offset="0x00000578" rw="RW" size="4">
          <bitfield caption="Color Space Conversion R coefficient for Luminance component, signed format, step set to 1/1024" mask="0x000003FF" name="CSCYR"/>
          <bitfield caption="Color Space Conversion G coefficient for Luminance component, signed format, step set to 1/512" mask="0x000FFC00" name="CSCYG"/>
          <bitfield caption="Color Space Conversion B coefficient for Luminance component, signed format, step set to 1/1024" mask="0x3FF00000" name="CSCYB"/>
          <bitfield caption="Color Space Conversion Luminance Offset" mask="0x40000000" name="CSCYOFF"/>
        </register>
        <register caption="Post Processing Configuration Register 4" name="LCDC_PPCFG4" offset="0x0000057C" rw="RW" size="4">
          <bitfield caption="Color Space Conversion R coefficient for Chrominance B component, signed format. (step 1/1024)" mask="0x000003FF" name="CSCUR"/>
          <bitfield caption="Color Space Conversion G coefficient for Chrominance B component, signed format. (step 1/512)" mask="0x000FFC00" name="CSCUG"/>
          <bitfield caption="Color Space Conversion B coefficient for Chrominance B component, signed format. (step 1/512)" mask="0x3FF00000" name="CSCUB"/>
          <bitfield caption="Color Space Conversion Chrominance B Offset" mask="0x40000000" name="CSCUOFF"/>
        </register>
        <register caption="Post Processing Configuration Register 5" name="LCDC_PPCFG5" offset="0x00000580" rw="RW" size="4">
          <bitfield caption="Color Space Conversion R coefficient for Chrominance R component, signed format. (step 1/1024)" mask="0x000003FF" name="CSCVR"/>
          <bitfield caption="Color Space Conversion G coefficient for Chrominance R component, signed format. (step 1/512)" mask="0x000FFC00" name="CSCVG"/>
          <bitfield caption="Color Space Conversion B coefficient for Chrominance R component, signed format. (step 1/1024)" mask="0x3FF00000" name="CSCVB"/>
          <bitfield caption="Color Space Conversion Chrominance R Offset" mask="0x40000000" name="CSCVOFF"/>
        </register>
        <register caption="Base CLUT Register" count="256" name="LCDC_BASECLUT" offset="0x00000600" rw="RW" size="4">
          <bitfield caption="Blue Color Entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color Entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color Entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register" count="256" name="LCDC_OVR1CLUT" offset="0x00000A00" rw="RW" size="4">
          <bitfield caption="Blue Color Entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color Entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color Entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color Entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register" count="256" name="LCDC_OVR2CLUT" offset="0x00000E00" rw="RW" size="4">
          <bitfield caption="Blue Color Entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color Entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color Entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color Entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="High-End Overlay CLUT Register" count="256" name="LCDC_HEOCLUT" offset="0x00001200" rw="RW" size="4">
          <bitfield caption="Blue Color Entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color Entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color Entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color Entry" mask="0xFF000000" name="ACLUT"/>
        </register>
      </register-group>
      <value-group caption="LCD Controller Output Mode" name="LCDC_LCDCFG5__MODE">
        <value caption="LCD Output mode is set to 12 bits per pixel" name="OUTPUT_12BPP" value="0x0"/>
        <value caption="LCD Output mode is set to 16 bits per pixel" name="OUTPUT_16BPP" value="0x1"/>
        <value caption="LCD Output mode is set to 18 bits per pixel" name="OUTPUT_18BPP" value="0x2"/>
        <value caption="LCD Output mode is set to 24 bits per pixel" name="OUTPUT_24BPP" value="0x3"/>
      </value-group>
      <value-group caption="PWM Clock Prescaler" name="LCDC_LCDCFG6__PWMPS">
        <value caption="The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK" name="DIV_1" value="0x0"/>
        <value caption="The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/2" name="DIV_2" value="0x1"/>
        <value caption="The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/4" name="DIV_4" value="0x2"/>
        <value caption="The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/8" name="DIV_8" value="0x3"/>
        <value caption="The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/16" name="DIV_16" value="0x4"/>
        <value caption="The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/32" name="DIV_32" value="0x5"/>
        <value caption="The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/64" name="DIV_64" value="0x6"/>
      </value-group>
      <value-group caption="AHB Burst Length" name="LCDC_BASECFG0__BLEN">
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_SINGLE" value="0x0"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR4" value="0x1"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR8" value="0x2"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR16" value="0x3"/>
      </value-group>
