zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
      <value-group caption="RGB Mode Input Selection" name="LCDC_BASECFG1__RGBMODE">
        <value caption="12 bpp RGB 444" name="_12BPP_RGB_444" value="0x0"/>
        <value caption="16 bpp ARGB 4444" name="_16BPP_ARGB_4444" value="0x1"/>
        <value caption="16 bpp RGBA 4444" name="_16BPP_RGBA_4444" value="0x2"/>
        <value caption="16 bpp RGB 565" name="_16BPP_RGB_565" value="0x3"/>
        <value caption="16 bpp TRGB 1555" name="_16BPP_TRGB_1555" value="0x4"/>
        <value caption="18 bpp RGB 666" name="_18BPP_RGB_666" value="0x5"/>
        <value caption="18 bpp RGB 666 PACKED" name="_18BPP_RGB_666PACKED" value="0x6"/>
        <value caption="19 bpp TRGB 1666" name="_19BPP_TRGB_1666" value="0x7"/>
        <value caption="19 bpp TRGB 1666 PACKED" name="_19BPP_TRGB_PACKED" value="0x8"/>
        <value caption="24 bpp RGB 888" name="_24BPP_RGB_888" value="0x9"/>
        <value caption="24 bpp RGB 888 PACKED" name="_24BPP_RGB_888_PACKED" value="0xA"/>
        <value caption="25 bpp TRGB 1888" name="_25BPP_TRGB_1888" value="0xB"/>
        <value caption="32 bpp ARGB 8888" name="_32BPP_ARGB_8888" value="0xC"/>
        <value caption="32 bpp RGBA 8888" name="_32BPP_RGBA_8888" value="0xD"/>
      </value-group>
      <value-group caption="Color Lookup Table Mode Input Selection" name="LCDC_BASECFG1__CLUTMODE">
        <value caption="Color Lookup Table mode set to 1 bit per pixel" name="CLUT_1BPP" value="0x0"/>
        <value caption="Color Lookup Table mode set to 2 bits per pixel" name="CLUT_2BPP" value="0x1"/>
        <value caption="Color Lookup Table mode set to 4 bits per pixel" name="CLUT_4BPP" value="0x2"/>
        <value caption="Color Lookup Table mode set to 8 bits per pixel" name="CLUT_8BPP" value="0x3"/>
      </value-group>
      <value-group caption="AHB Burst Length" name="LCDC_OVR1CFG0__BLEN">
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_BLEN_SINGLE" value="0x0"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_BLEN_INCR4" value="0x1"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_BLEN_INCR8" value="0x2"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_BLEN_INCR16" value="0x3"/>
      </value-group>
      <value-group caption="RGB Mode Input Selection" name="LCDC_OVR1CFG1__RGBMODE">
        <value caption="12 bpp RGB 444" name="_12BPP_RGB_444" value="0x0"/>
        <value caption="16 bpp ARGB 4444" name="_16BPP_ARGB_4444" value="0x1"/>
        <value caption="16 bpp RGBA 4444" name="_16BPP_RGBA_4444" value="0x2"/>
        <value caption="16 bpp RGB 565" name="_16BPP_RGB_565" value="0x3"/>
        <value caption="16 bpp TRGB 1555" name="_16BPP_TRGB_1555" value="0x4"/>
        <value caption="18 bpp RGB 666" name="_18BPP_RGB_666" value="0x5"/>
        <value caption="18 bpp RGB 666 PACKED" name="_18BPP_RGB_666PACKED" value="0x6"/>
        <value caption="19 bpp TRGB 1666" name="_19BPP_TRGB_1666" value="0x7"/>
        <value caption="19 bpp TRGB 1666 PACKED" name="_19BPP_TRGB_PACKED" value="0x8"/>
        <value caption="24 bpp RGB 888" name="_24BPP_RGB_888" value="0x9"/>
        <value caption="24 bpp RGB 888 PACKED" name="_24BPP_RGB_888_PACKED" value="0xA"/>
        <value caption="25 bpp TRGB 1888" name="_25BPP_TRGB_1888" value="0xB"/>
        <value caption="32 bpp ARGB 8888" name="_32BPP_ARGB_8888" value="0xC"/>
        <value caption="32 bpp RGBA 8888" name="_32BPP_RGBA_8888" value="0xD"/>
      </value-group>
      <value-group caption="Color Lookup Table Mode Input Selection" name="LCDC_OVR1CFG1__CLUTMODE">
        <value caption="Color Lookup Table mode set to 1 bit per pixel" name="CLUT_1BPP" value="0x0"/>
        <value caption="Color Lookup Table mode set to 2 bits per pixel" name="CLUT_2BPP" value="0x1"/>
        <value caption="Color Lookup Table mode set to 4 bits per pixel" name="CLUT_4BPP" value="0x2"/>
        <value caption="Color Lookup Table mode set to 8 bits per pixel" name="CLUT_8BPP" value="0x3"/>
      </value-group>
      <value-group caption="AHB Burst Length" name="LCDC_OVR2CFG0__BLEN">
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_SINGLE" value="0x0"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR4" value="0x1"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR8" value="0x2"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR16" value="0x3"/>
      </value-group>
      <value-group caption="Source Interface" name="LCDC_OVR2CFG0__SIF">
        <value caption="Overlay 2 data is retrieved through System Bus interface 0." name="0" value="0x0"/>
        <value caption="Overlay 2 data is retrieved through System Bus interface 1." name="1" value="0x1"/>
      </value-group>
