zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
      <value-group caption="Transfer Size on Port x [x = 0..7]" name="MPDDRC_MINFO0__SIZE">
        <value caption="Byte transfer" name="_8BITS" value="0x0"/>
        <value caption="Halfword transfer" name="_16BITS" value="0x1"/>
        <value caption="Word transfer" name="_32BITS" value="0x2"/>
        <value caption="Dword transfer" name="_64BITS" value="0x3"/>
      </value-group>
      <value-group caption="Type of Burst on Port x [x = 0..7]" name="MPDDRC_MINFO1__BURST">
        <value caption="Single transfer" name="SINGLE" value="0x0"/>
        <value caption="Incrementing burst of unspecified length" name="INCR" value="0x1"/>
        <value caption="4-beat wrapping burst" name="WRAP4" value="0x2"/>
        <value caption="4-beat incrementing burst" name="INCR4" value="0x3"/>
        <value caption="8-beat wrapping burst" name="WRAP8" value="0x4"/>
        <value caption="8-beat incrementing burst" name="INCR8" value="0x5"/>
        <value caption="16-beat wrapping burst" name="WRAP16" value="0x6"/>
        <value caption="16-beat incrementing burst" name="INCR16" value="0x7"/>
      </value-group>
      <value-group caption="Transfer Size on Port x [x = 0..7]" name="MPDDRC_MINFO1__SIZE">
        <value caption="Byte transfer" name="_8BITS" value="0x0"/>
        <value caption="Halfword transfer" name="_16BITS" value="0x1"/>
        <value caption="Word transfer" name="_32BITS" value="0x2"/>
        <value caption="Dword transfer" name="_64BITS" value="0x3"/>
      </value-group>
      <value-group caption="Type of Burst on Port x [x = 0..7]" name="MPDDRC_MINFO2__BURST">
        <value caption="Single transfer" name="SINGLE" value="0x0"/>
        <value caption="Incrementing burst of unspecified length" name="INCR" value="0x1"/>
        <value caption="4-beat wrapping burst" name="WRAP4" value="0x2"/>
        <value caption="4-beat incrementing burst" name="INCR4" value="0x3"/>
        <value caption="8-beat wrapping burst" name="WRAP8" value="0x4"/>
        <value caption="8-beat incrementing burst" name="INCR8" value="0x5"/>
        <value caption="16-beat wrapping burst" name="WRAP16" value="0x6"/>
        <value caption="16-beat incrementing burst" name="INCR16" value="0x7"/>
      </value-group>
      <value-group caption="Transfer Size on Port x [x = 0..7]" name="MPDDRC_MINFO2__SIZE">
        <value caption="Byte transfer" name="_8BITS" value="0x0"/>
        <value caption="Halfword transfer" name="_16BITS" value="0x1"/>
        <value caption="Word transfer" name="_32BITS" value="0x2"/>
        <value caption="Dword transfer" name="_64BITS" value="0x3"/>
      </value-group>
      <value-group caption="Type of Burst on Port x [x = 0..7]" name="MPDDRC_MINFO3__BURST">
        <value caption="Single transfer" name="SINGLE" value="0x0"/>
        <value caption="Incrementing burst of unspecified length" name="INCR" value="0x1"/>
        <value caption="4-beat wrapping burst" name="WRAP4" value="0x2"/>
        <value caption="4-beat incrementing burst" name="INCR4" value="0x3"/>
        <value caption="8-beat wrapping burst" name="WRAP8" value="0x4"/>
        <value caption="8-beat incrementing burst" name="INCR8" value="0x5"/>
        <value caption="16-beat wrapping burst" name="WRAP16" value="0x6"/>
        <value caption="16-beat incrementing burst" name="INCR16" value="0x7"/>
      </value-group>
      <value-group caption="Transfer Size on Port x [x = 0..7]" name="MPDDRC_MINFO3__SIZE">
        <value caption="Byte transfer" name="_8BITS" value="0x0"/>
        <value caption="Halfword transfer" name="_16BITS" value="0x1"/>
        <value caption="Word transfer" name="_32BITS" value="0x2"/>
        <value caption="Dword transfer" name="_64BITS" value="0x3"/>
      </value-group>
      <value-group caption="Type of Burst on Port x [x = 0..7]" name="MPDDRC_MINFO4__BURST">
        <value caption="Single transfer" name="SINGLE" value="0x0"/>
        <value caption="Incrementing burst of unspecified length" name="INCR" value="0x1"/>
        <value caption="4-beat wrapping burst" name="WRAP4" value="0x2"/>
        <value caption="4-beat incrementing burst" name="INCR4" value="0x3"/>
        <value caption="8-beat wrapping burst" name="WRAP8" value="0x4"/>
        <value caption="8-beat incrementing burst" name="INCR8" value="0x5"/>
        <value caption="16-beat wrapping burst" name="WRAP16" value="0x6"/>
        <value caption="16-beat incrementing burst" name="INCR16" value="0x7"/>
      </value-group>
      <value-group caption="Transfer Size on Port x [x = 0..7]" name="MPDDRC_MINFO4__SIZE">
        <value caption="Byte transfer" name="_8BITS" value="0x0"/>
        <value caption="Halfword transfer" name="_16BITS" value="0x1"/>
        <value caption="Word transfer" name="_32BITS" value="0x2"/>
        <value caption="Dword transfer" name="_64BITS" value="0x3"/>
      </value-group>
      <value-group caption="Type of Burst on Port x [x = 0..7]" name="MPDDRC_MINFO5__BURST">
        <value caption="Single transfer" name="SINGLE" value="0x0"/>
        <value caption="Incrementing burst of unspecified length" name="INCR" value="0x1"/>
        <value caption="4-beat wrapping burst" name="WRAP4" value="0x2"/>
        <value caption="4-beat incrementing burst" name="INCR4" value="0x3"/>
        <value caption="8-beat wrapping burst" name="WRAP8" value="0x4"/>
        <value caption="8-beat incrementing burst" name="INCR8" value="0x5"/>
        <value caption="16-beat wrapping burst" name="WRAP16" value="0x6"/>
        <value caption="16-beat incrementing burst" name="INCR16" value="0x7"/>
      </value-group>
      <value-group caption="Transfer Size on Port x [x = 0..7]" name="MPDDRC_MINFO5__SIZE">
        <value caption="Byte transfer" name="_8BITS" value="0x0"/>
        <value caption="Halfword transfer" name="_16BITS" value="0x1"/>
        <value caption="Word transfer" name="_32BITS" value="0x2"/>
        <value caption="Dword transfer" name="_64BITS" value="0x3"/>
      </value-group>
