zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
      <value-group caption="Data Transfer Type" name="QSPI_IFR__TFRTYP">
        <value caption="Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial Flash memory is not possible." name="TRSFR_READ" value="0x0"/>
        <value caption="Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial Flash memory is possible." name="TRSFR_READ_MEMORY" value="0x1"/>
        <value caption="Write transfer into the serial memory.Scrambling is not performed." name="TRSFR_WRITE" value="0x2"/>
        <value caption="Write data transfer into the serial memory.If enabled, scrambling is performed." name="TRSFR_WRITE_MEMORY" value="0x3"/>
      </value-group>
      <value-group caption="Continuous Read Mode" name="QSPI_IFR__CRM">
        <value caption="Continuous Read mode is disabled." name="DISABLED" value="0"/>
        <value caption="Continuous Read mode is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Scrambling/Unscrambling Enable" name="QSPI_SMR__SCREN">
        <value caption="The scrambling/unscrambling is disabled." name="DISABLED" value="0"/>
        <value caption="The scrambling/unscrambling is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="QSPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x515350"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__CSMODE">
        <value caption="The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer." name="NOT_RELOADED" value="0x0"/>
        <value caption="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in QSPI_TDR.TD has been transferred." name="LASTXFER" value="0x1"/>
        <value caption="The chip select is deasserted systematically after each transfer." name="SYSTEMATICALLY" value="0x2"/>
      </value-group>
    </module>
    <module caption="Reset Controller" id="11265" name="RSTC" version="C">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_CR__KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP" values="RSTC_SR__RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="Slow Clock Switching" mask="0x00000002" name="SCKSW"/>          
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_MR__KEY"/>
        </register>
      </register-group>
      <value-group caption="Write Access Password" name="RSTC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Reset Type" name="RSTC_SR__RSTTYP">
        <value caption="Both VDDCORE and VDDBU rising" name="GENERAL_RST" value="0x0"/>
        <value caption="VDDCORE rising" name="WKUP_RST" value="0x1"/>
        <value caption="Watchdog fault occurred" name="WDT_RST" value="0x2"/>
        <value caption="Processor reset required by the software" name="SOFT_RST" value="0x3"/>
        <value caption="NRST pin detected low" name="USER_RST" value="0x4"/>
      </value-group>
      <value-group caption="Write Access Password" name="RSTC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module caption="Real-time Clock" id="6056" name="RTC" version="ZE">
      <register-group name="RTC_TS" size="12">
        <register caption="TimeStamp Time Register 0" name="RTC_TSTR" offset="0x0" rw="R" size="4">
          <mode name="DEFAULT" qualifier="RTC_MR.UTC" value="0"/>
          <mode name="UTC_MODE" qualifier="RTC_MR.UTC" value="0"/>
          <bitfield caption="Seconds of the Tamper" mask="0x0000007F" modes="DEFAULT" name="SEC"/>
          <bitfield caption="Minutes of the Tamper" mask="0x00007F00" modes="DEFAULT" name="MIN"/>
          <bitfield caption="Hours of the Tamper" mask="0x003F0000" modes="DEFAULT" name="HOUR"/>
          <bitfield caption="AM/PM Indicator of the Tamper" mask="0x00400000" modes="DEFAULT" name="AMPM"/>
          <bitfield caption="Tamper Events Counter" mask="0x0F000000" modes="DEFAULT" name="TEVCNT"/>
          <bitfield caption="System Mode of the Tamper" mask="0x80000000" modes="DEFAULT" name="BACKUP"/>
          <bitfield caption="Tamper Events Counter (cleared by reading RTC_TSSR0)" mask="0x0F000000" modes="UTC_MODE" name="TEVCNT"/>
          <bitfield caption="System Mode of the Tamper (cleared by reading RTC_TSSR0)" mask="0x80000000" modes="UTC_MODE" name="BACKUP"/>
        </register>
        <register caption="TimeStamp Date Register 0" name="RTC_TSDR" offset="0x4" rw="R" size="4">
          <mode name="DEFAULT" qualifier="RTC_MR.UTC" value="0"/>
          <mode name="UTC_MODE" qualifier="RTC_MR.UTC" value="0"/>
          <bitfield caption="Century of the Tamper" mask="0x0000007F" modes="DEFAULT" name="CENT"/>
          <bitfield caption="Year of the Tamper" mask="0x0000FF00" modes="DEFAULT" name="YEAR"/>
          <bitfield caption="Month of the Tamper" mask="0x001F0000" modes="DEFAULT" name="MONTH"/>
          <bitfield caption="Day of the Tamper" mask="0x00E00000" modes="DEFAULT" name="DAY"/>
          <bitfield caption="Date of the Tamper" mask="0x3F000000" modes="DEFAULT" name="DATE"/>
          <bitfield caption="Time of the Tamper (UTC format)" mask="0xFFFFFFFF" modes="UTC_MODE" name="UTC_TIME"/>
        </register>
        <register caption="TimeStamp Source Register 0" name="RTC_TSSR" offset="0x8" rw="R" size="4">
          <bitfield caption="Test Pin Monitor" mask="0x00000004" name="TST"/>
          <bitfield caption="JTAG Pins Monitor" mask="0x00000008" name="JTAG"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00800000" name="DET7"/>
        </register>
      </register-group>
      <register-group name="RTC">
        <register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
          <bitfield caption="PERSIAN Calendar" mask="0x00000002" name="PERSIAN"/>
          <bitfield caption="UTC Time Format" mask="0x00000004" name="UTC"/>
          <bitfield caption="NEGative PPM Correction" mask="0x00000010" name="NEGPPM"/>
          <bitfield caption="Slow Clock Correction" mask="0x00007F00" name="CORRECTION"/>
          <bitfield caption="HIGH PPM Correction" mask="0x00008000" name="HIGHPPM"/>
          <bitfield caption="All ADC Channel Trigger Event Source Selection" mask="0x00070000" name="OUT0" values="RTC_MR__OUT0"/>
          <bitfield caption="ADC Last Channel Trigger Event Source Selection" mask="0x00700000" name="OUT1" values="RTC_MR__OUT1"/>
          <bitfield caption="High Duration of the Output Pulse" mask="0x07000000" name="THIGH" values="RTC_MR__THIGH"/>
          <bitfield caption="Period of the Output Pulse" mask="0x30000000" name="TPERIOD" values="RTC_MR__TPERIOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <mode name="DEFAULT" qualifier="RTC_MR.UTC" value="0"/>
          <mode name="UTC_MODE" qualifier="RTC_MR.UTC" value="0"/>
          <bitfield caption="Current Second" mask="0x0000007F" modes="DEFAULT" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" modes="DEFAULT" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" modes="DEFAULT" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" modes="DEFAULT" name="AMPM"/>
          <bitfield caption="Current UTC Time" mask="0xFFFFFFFF" modes="UTC_MODE" name="UTC_TIME"/>
        </register>
