zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
      <value-group caption="Command CRC Error Status Enable" name="SDMMC_EISTER__CMDCRC">
        <value caption="The CMDCRC status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDCRC status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command End Bit Error Status Enable" name="SDMMC_EISTER__CMDEND">
        <value caption="The CMDEND status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDEND status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Index Error Status Enable" name="SDMMC_EISTER__CMDIDX">
        <value caption="The CMDIDX status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDIDX status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data Timeout Error Status Enable" name="SDMMC_EISTER__DATTEO">
        <value caption="The DATTEO status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATTEO status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data CRC Error Status Enable" name="SDMMC_EISTER__DATCRC">
        <value caption="The DATCRC status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATCRC status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data End Bit Error Status Enable" name="SDMMC_EISTER__DATEND">
        <value caption="The DATEND status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATEND status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Current Limit Error Status Enable" name="SDMMC_EISTER__CURLIM">
        <value caption="The CURLIM status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CURLIM status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Auto CMD Error Status Enable" name="SDMMC_EISTER__ACMD">
        <value caption="The ACMD status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The ACMD status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="ADMA Error Status Enable" name="SDMMC_EISTER__ADMA">
        <value caption="The ADMA status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The ADMA status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Timeout Error Status Enable" name="SDMMC_EISTER_E_MMC__CMDTEO">
        <value caption="The CMDTEO status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDTEO status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command CRC Error Status Enable" name="SDMMC_EISTER_E_MMC__CMDCRC">
        <value caption="The CMDCRC status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDCRC status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command End Bit Error Status Enable" name="SDMMC_EISTER_E_MMC__CMDEND">
        <value caption="The CMDEND status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDEND status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Index Error Status Enable" name="SDMMC_EISTER_E_MMC__CMDIDX">
        <value caption="The CMDIDX status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDIDX status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data Timeout Error Status Enable" name="SDMMC_EISTER_E_MMC__DATTEO">
        <value caption="The DATTEO status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATTEO status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data CRC Error Status Enable" name="SDMMC_EISTER_E_MMC__DATCRC">
        <value caption="The DATCRC status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATCRC status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data End Bit Error Status Enable" name="SDMMC_EISTER_E_MMC__DATEND">
        <value caption="The DATEND status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATEND status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Current Limit Error Status Enable" name="SDMMC_EISTER_E_MMC__CURLIM">
        <value caption="The CURLIM status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CURLIM status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Auto CMD Error Status Enable" name="SDMMC_EISTER_E_MMC__ACMD">
        <value caption="The ACMD status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The ACMD status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="ADMA Error Status Enable" name="SDMMC_EISTER_E_MMC__ADMA">
        <value caption="The ADMA status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The ADMA status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Boot Acknowledge Error Status Enable" name="SDMMC_EISTER_E_MMC__BOOTAE">
        <value caption="The BOOTAE status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The BOOTAE status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
