zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
        <register caption="Normal Interrupt Enable Protection Register" name="SECUMOD_NIEPR" offset="0x0084" rw="W" size="4">
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Enable" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Enable" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Enable" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Enable" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Enable" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Enable" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Enable" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Enable" mask="0x00800000" name="DET7"/>
        </register>
        <register caption="Normal Interrupt Disable Protection Register" name="SECUMOD_NIDPR" offset="0x0088" rw="W" size="4">
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Disable" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Disable" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Disable" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Disable" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Disable" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Disable" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Disable" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Disable" mask="0x00800000" name="DET7"/>
        </register>
        <register caption="Normal Interrupt Mask Protection Register" name="SECUMOD_NIMPR" offset="0x008C" rw="R" size="4">
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Mask" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Mask" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Mask" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Mask" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Mask" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Mask" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Mask" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector Protection Interrupt Mask" mask="0x00800000" name="DET7"/>
        </register>
        <register caption="Wakeup Protection Register" name="SECUMOD_WKPR" offset="0x0090" rw="RW" size="4">
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00800000" name="DET7"/>
        </register>
      </register-group>
    </module>
    <module caption="Secure Fuse Controller" id="11170" name="SFC" version="I">
      <register-group name="SFC">
        <register caption="SFC Key Register" name="SFC_KR" offset="0x00" rw="W" size="4">
          <bitfield caption="Key Code" mask="0x000000FF" name="KEY"/>
        </register>
        <register caption="SFC Mode Register" name="SFC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Mask Data Registers" mask="0x00000001" name="MSK"/>
          <bitfield caption="Sense Amplifier Selection" mask="0x00000010" name="SASEL"/>
        </register>
        <register caption="SFC Interrupt Enable Register" name="SFC_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Programming Sequence Completed Interrupt Enable" mask="0x00000001" name="PGMC"/>
          <bitfield caption="Programming Sequence Failed Interrupt Enable" mask="0x00000002" name="PGMF"/>
          <bitfield caption="Live Integrity Check Error Interrupt Enable" mask="0x00000010" name="LCHECK"/>
          <bitfield caption="Area Check Error Interrupt Enable" mask="0x00020000" name="ACE"/>
        </register>
        <register caption="SFC Interrupt Disable Register" name="SFC_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Programming Sequence Completed Interrupt Disable" mask="0x00000001" name="PGMC"/>
          <bitfield caption="Programming Sequence Failed Interrupt Disable" mask="0x00000002" name="PGMF"/>
          <bitfield caption="Live Integrity Check Error Interrupt Disable" mask="0x00000010" name="LCHECK"/>
          <bitfield caption="Area Check Error Interrupt Disable" mask="0x00020000" name="ACE"/>
        </register>
        <register caption="SFC Interrupt Mask Register" name="SFC_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Programming Sequence Completed Interrupt Mask" mask="0x00000001" name="PGMC"/>
          <bitfield caption="Programming Sequence Failed Interrupt Mask" mask="0x00000002" name="PGMF"/>
          <bitfield caption="Live Integrity Checking Error Interrupt Mask" mask="0x00000010" name="LCHECK"/>
          <bitfield caption="Area Check Error Interrupt Mask" mask="0x00020000" name="ACE"/>
        </register>
        <register caption="SFC Status Register" name="SFC_SR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Programming Sequence Completed (cleared on read)" mask="0x00000001" name="PGMC"/>
          <bitfield caption="Programming Sequence Failed (cleared on read)" mask="0x00000002" name="PGMF"/>
          <bitfield caption="Live Integrity Checking Error (cleared on read)" mask="0x00000010" name="LCHECK"/>
          <bitfield caption="Area Check Error (cleared on read)" mask="0x00020000" name="ACE"/>
        </register>
        <register caption="SFC Data Register" count="17" name="SFC_DR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Fuse Data" mask="0xFFFFFFFF" name="DATA"/>
        </register>
      </register-group>
    </module>
    <module caption="Special Function Registers" id="11066" name="SFR" version="S">
      <register-group name="SFR">
        <register caption="DDR Configuration Register" name="SFR_DDRCFG" offset="0x04" rw="RW" size="4">
          <bitfield caption="Force DDR_DQ Input Buffer Always On" mask="0x00010000" name="FDQIEN"/>
          <bitfield caption="Force DDR_DQS Input Buffer Always On" mask="0x00020000" name="FDQSIEN"/>
        </register>
        <register caption="OHCI Interrupt Configuration Register" name="SFR_OHCIICR" offset="0x10" rw="RW" size="4">
          <bitfield caption="USB PORTx RESET" mask="0x00000001" name="RES0"/>
          <bitfield caption="USB PORTx RESET" mask="0x00000002" name="RES1"/>
          <bitfield caption="USB PORTx RESET" mask="0x00000004" name="RES2"/>
          <bitfield caption="OHCI Asynchronous Resume Interrupt Enable" mask="0x00000010" name="ARIE"/>
          <bitfield caption="Reserved" mask="0x00000020" name="APPSTART"/>
          <bitfield caption="USB PORT A" mask="0x00000100" name="SUSPEND_A"/>
          <bitfield caption="USB PORT B" mask="0x00000200" name="SUSPEND_B"/>
          <bitfield caption="USB PORT C" mask="0x00000400" name="SUSPEND_C"/>
          <bitfield caption="USB DEVICE PULLUP DISABLE" mask="0x00800000" name="UDPPUDIS"/>
          <bitfield caption="Reserved" mask="0x08000000" name="HSIC_SEL"/>
        </register>
        <register caption="OHCI Interrupt Status Register" name="SFR_OHCIISR" offset="0x14" rw="R" size="4">
          <bitfield caption="OHCI Resume Interrupt Status Port 0" mask="0x00000001" name="RIS0"/>
          <bitfield caption="OHCI Resume Interrupt Status Port 1" mask="0x00000002" name="RIS1"/>
          <bitfield caption="OHCI Resume Interrupt Status Port 2" mask="0x00000004" name="RIS2"/>
        </register>
        <register caption="Security Configuration Register" name="SFR_SECURE" offset="0x28" rw="RW" size="4">
          <bitfield caption="Disable Access to ROM Code" mask="0x00000001" name="ROM"/>
          <bitfield caption="Disable Access to Fuse Controller" mask="0x00000100" name="FUSE"/>
        </register>
        <register caption="UTMI Clock Trimming Register" name="SFR_UTMICKTRIM" offset="0x30" rw="RW" size="4">
          <bitfield caption="UTMI Reference Clock Frequency" mask="0x00000003" name="FREQ" values="SFR_UTMICKTRIM__FREQ"/>
          <bitfield caption="UTMI Band Gap Voltage Trimming" mask="0x00030000" name="VBG"/>
        </register>
        <register caption="UTMI High-Speed Trimming Register" name="SFR_UTMIHSTRIM" offset="0x34" rw="RW" size="4">
          <bitfield caption="UTMI HS SQUELCH Voltage Trimming" mask="0x00000007" name="SQUELCH"/>
          <bitfield caption="UTMI Disconnect Voltage Trimming" mask="0x00000070" name="DISC"/>
          <bitfield caption="UTMI HS PORTx Transceiver Slope Trimming" mask="0x00000700" name="SLOPE0"/>
          <bitfield caption="UTMI HS PORTx Transceiver Slope Trimming" mask="0x00007000" name="SLOPE1"/>
          <bitfield caption="UTMI HS PORTx Transceiver Slope Trimming" mask="0x00070000" name="SLOPE2"/>
        </register>
        <register caption="UTMI Full-Speed Trimming Register" name="SFR_UTMIFSTRIM" offset="0x38" rw="RW" size="4">
          <bitfield caption="FS Transceiver Output Rising Slope Trimming" mask="0x00000007" name="RISE"/>
          <bitfield caption="FS Transceiver Output Falling Slope Trimming" mask="0x00000070" name="FALL"/>
          <bitfield caption="FS Transceiver Crossover Voltage Trimming" mask="0x00000300" name="XCVR"/>
          <bitfield caption="FS Transceiver NMOS Impedance Trimming" mask="0x00070000" name="ZN"/>
          <bitfield caption="FS Transceiver PMOS Impedance Trimming" mask="0x00700000" name="ZP"/>
        </register>
