zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
        <register caption="Transmit Data Register" name="SPI_TDR" offset="0x0C" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Transmit Data" mask="0x0000FFFF" modes="DEFAULT" name="TD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" modes="DEFAULT" name="PCS" values="SPI_TDR__PCS"/>
          <bitfield caption="Last Transfer" mask="0x01000000" modes="DEFAULT" name="LASTXFER"/>
          <bitfield caption="Transmit Data" mask="0x0000FFFF" modes="FIFO_MULTI_DATA" name="TD0"/>
          <bitfield caption="Transmit Data" mask="0xFFFF0000" modes="FIFO_MULTI_DATA" name="TD1"/>
        </register>
        <register caption="Status Register" name="SPI_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full (cleared by reading SPI_RDR)" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty (cleared by writing SPI_TDR)" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error (cleared on read)" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Status (cleared on read)" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising (cleared on read)" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty (cleared by writing SPI_TDR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Status (Slave mode only) (cleared on read)" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Status (cleared on read)" mask="0x00000800" name="CMP"/>
          <bitfield caption="SPI Enable Status" mask="0x00010000" name="SPIENS"/>
          <bitfield caption="Transmit FIFO Empty Flag (cleared on read)" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="Transmit FIFO Full Flag (cleared on read)" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="Transmit FIFO Threshold Flag (cleared on read)" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="Receive FIFO Empty Flag" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="Receive FIFO Full Flag" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="Receive FIFO Threshold Flag" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="Transmit FIFO Pointer Error Flag" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="Receive FIFO Pointer Error Flag" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="Interrupt Enable Register" name="SPI_IER" offset="0x14" rw="W" size="4" atomic-op="set:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Enable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00000800" name="CMP"/>
          <bitfield caption="TXFEF Interrupt Enable" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="Interrupt Disable Register" name="SPI_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Disable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Disable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00000800" name="CMP"/>
          <bitfield caption="TXFEF Interrupt Disable" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="Interrupt Mask Register" name="SPI_IMR" offset="0x1C" rw="R" size="4" atomic-op="read:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Mask" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Mask" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00000800" name="CMP"/>
          <bitfield caption="TXFEF Interrupt Mask" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="Chip Select Register" count="4" name="SPI_CSR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Clock Polarity" mask="0x00000001" name="CPOL" values="SPI_CSR__CPOL"/>
          <bitfield caption="Clock Phase" mask="0x00000002" name="NCPHA" values="SPI_CSR__NCPHA"/>
          <bitfield caption="Chip Select Not Active After Transfer (ignored if CSAAT = 1)" mask="0x00000004" name="CSNAAT"/>
          <bitfield caption="Chip Select Active After Transfer" mask="0x00000008" name="CSAAT"/>
          <bitfield caption="Bits Per Transfer" mask="0x000000F0" name="BITS" values="SPI_CSR__BITS"/>
          <bitfield caption="Serial Clock Bit Rate" mask="0x0000FF00" name="SCBR"/>
          <bitfield caption="Delay Before SPCK" mask="0x00FF0000" name="DLYBS"/>
          <bitfield caption="Delay Between Consecutive Transfers" mask="0xFF000000" name="DLYBCT"/>
        </register>
        <register caption="FIFO Mode Register" name="SPI_FMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Transmit Data Register Empty Mode" mask="0x00000003" name="TXRDYM" values="SPI_FMR__TXRDYM"/>
          <bitfield caption="Receive Data Register Full Mode" mask="0x00000030" name="RXRDYM" values="SPI_FMR__RXRDYM"/>
          <bitfield caption="Transmit FIFO Threshold" mask="0x003F0000" name="TXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold" mask="0x3F000000" name="RXFTHRES"/>
        </register>
        <register caption="FIFO Level Register" name="SPI_FLR" offset="0x44" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="Comparison Register" name="SPI_CMPR" offset="0x48" rw="R" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x0000FFFF" name="VAL1"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0xFFFF0000" name="VAL2"/>
        </register>
        <register caption="Write Protection Mode Register" name="SPI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SPI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SPI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Bit Rate Source Clock" name="SPI_MR__BRSRCCLK">
        <value caption="The peripheral clock is the source clock for the bit rate generation." name="PERIPH_CLK" value="0"/>
        <value caption="PMC GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Comparison Mode" name="SPI_MR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception of all incoming characters until REQCLR is set." name="START_CONDITION" value="1"/>
      </value-group>
