zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27SOM1.atdf
        <register caption="Global Channel Read Write Resume Register" name="XDMAC_GRWR" offset="0x34" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Read Write Resume Bit" mask="0x00000001" name="RWR0"/>
          <bitfield caption="XDMAC Channel 1 Read Write Resume Bit" mask="0x00000002" name="RWR1"/>
          <bitfield caption="XDMAC Channel 2 Read Write Resume Bit" mask="0x00000004" name="RWR2"/>
          <bitfield caption="XDMAC Channel 3 Read Write Resume Bit" mask="0x00000008" name="RWR3"/>
          <bitfield caption="XDMAC Channel 4 Read Write Resume Bit" mask="0x00000010" name="RWR4"/>
          <bitfield caption="XDMAC Channel 5 Read Write Resume Bit" mask="0x00000020" name="RWR5"/>
          <bitfield caption="XDMAC Channel 6 Read Write Resume Bit" mask="0x00000040" name="RWR6"/>
          <bitfield caption="XDMAC Channel 7 Read Write Resume Bit" mask="0x00000080" name="RWR7"/>
          <bitfield caption="XDMAC Channel 8 Read Write Resume Bit" mask="0x00000100" name="RWR8"/>
          <bitfield caption="XDMAC Channel 9 Read Write Resume Bit" mask="0x00000200" name="RWR9"/>
          <bitfield caption="XDMAC Channel 10 Read Write Resume Bit" mask="0x00000400" name="RWR10"/>
          <bitfield caption="XDMAC Channel 11 Read Write Resume Bit" mask="0x00000800" name="RWR11"/>
          <bitfield caption="XDMAC Channel 12 Read Write Resume Bit" mask="0x00001000" name="RWR12"/>
          <bitfield caption="XDMAC Channel 13 Read Write Resume Bit" mask="0x00002000" name="RWR13"/>
          <bitfield caption="XDMAC Channel 14 Read Write Resume Bit" mask="0x00004000" name="RWR14"/>
          <bitfield caption="XDMAC Channel 15 Read Write Resume Bit" mask="0x00008000" name="RWR15"/>
        </register>
        <register caption="Global Channel Software Request Register" name="XDMAC_GSWR" offset="0x38" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Software Request Bit" mask="0x00000001" name="SWREQ0"/>
          <bitfield caption="XDMAC Channel 1 Software Request Bit" mask="0x00000002" name="SWREQ1"/>
          <bitfield caption="XDMAC Channel 2 Software Request Bit" mask="0x00000004" name="SWREQ2"/>
          <bitfield caption="XDMAC Channel 3 Software Request Bit" mask="0x00000008" name="SWREQ3"/>
          <bitfield caption="XDMAC Channel 4 Software Request Bit" mask="0x00000010" name="SWREQ4"/>
          <bitfield caption="XDMAC Channel 5 Software Request Bit" mask="0x00000020" name="SWREQ5"/>
          <bitfield caption="XDMAC Channel 6 Software Request Bit" mask="0x00000040" name="SWREQ6"/>
          <bitfield caption="XDMAC Channel 7 Software Request Bit" mask="0x00000080" name="SWREQ7"/>
          <bitfield caption="XDMAC Channel 8 Software Request Bit" mask="0x00000100" name="SWREQ8"/>
          <bitfield caption="XDMAC Channel 9 Software Request Bit" mask="0x00000200" name="SWREQ9"/>
          <bitfield caption="XDMAC Channel 10 Software Request Bit" mask="0x00000400" name="SWREQ10"/>
          <bitfield caption="XDMAC Channel 11 Software Request Bit" mask="0x00000800" name="SWREQ11"/>
          <bitfield caption="XDMAC Channel 12 Software Request Bit" mask="0x00001000" name="SWREQ12"/>
          <bitfield caption="XDMAC Channel 13 Software Request Bit" mask="0x00002000" name="SWREQ13"/>
          <bitfield caption="XDMAC Channel 14 Software Request Bit" mask="0x00004000" name="SWREQ14"/>
          <bitfield caption="XDMAC Channel 15 Software Request Bit" mask="0x00008000" name="SWREQ15"/>
        </register>
        <register caption="Global Channel Software Request Status Register" name="XDMAC_GSWS" offset="0x3C" rw="R" size="4">
          <bitfield caption="XDMAC Channel 0 Software Request Status Bit" mask="0x00000001" name="SWRS0"/>
          <bitfield caption="XDMAC Channel 1 Software Request Status Bit" mask="0x00000002" name="SWRS1"/>
          <bitfield caption="XDMAC Channel 2 Software Request Status Bit" mask="0x00000004" name="SWRS2"/>
          <bitfield caption="XDMAC Channel 3 Software Request Status Bit" mask="0x00000008" name="SWRS3"/>
          <bitfield caption="XDMAC Channel 4 Software Request Status Bit" mask="0x00000010" name="SWRS4"/>
          <bitfield caption="XDMAC Channel 5 Software Request Status Bit" mask="0x00000020" name="SWRS5"/>
          <bitfield caption="XDMAC Channel 6 Software Request Status Bit" mask="0x00000040" name="SWRS6"/>
          <bitfield caption="XDMAC Channel 7 Software Request Status Bit" mask="0x00000080" name="SWRS7"/>
          <bitfield caption="XDMAC Channel 8 Software Request Status Bit" mask="0x00000100" name="SWRS8"/>
          <bitfield caption="XDMAC Channel 9 Software Request Status Bit" mask="0x00000200" name="SWRS9"/>
          <bitfield caption="XDMAC Channel 10 Software Request Status Bit" mask="0x00000400" name="SWRS10"/>
          <bitfield caption="XDMAC Channel 11 Software Request Status Bit" mask="0x00000800" name="SWRS11"/>
          <bitfield caption="XDMAC Channel 12 Software Request Status Bit" mask="0x00001000" name="SWRS12"/>
          <bitfield caption="XDMAC Channel 13 Software Request Status Bit" mask="0x00002000" name="SWRS13"/>
          <bitfield caption="XDMAC Channel 14 Software Request Status Bit" mask="0x00004000" name="SWRS14"/>
          <bitfield caption="XDMAC Channel 15 Software Request Status Bit" mask="0x00008000" name="SWRS15"/>
        </register>
        <register caption="Global Channel Software Flush Request Register" name="XDMAC_GSWF" offset="0x40" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Software Flush Request Bit" mask="0x00000001" name="SWF0"/>
          <bitfield caption="XDMAC Channel 1 Software Flush Request Bit" mask="0x00000002" name="SWF1"/>
          <bitfield caption="XDMAC Channel 2 Software Flush Request Bit" mask="0x00000004" name="SWF2"/>
          <bitfield caption="XDMAC Channel 3 Software Flush Request Bit" mask="0x00000008" name="SWF3"/>
          <bitfield caption="XDMAC Channel 4 Software Flush Request Bit" mask="0x00000010" name="SWF4"/>
          <bitfield caption="XDMAC Channel 5 Software Flush Request Bit" mask="0x00000020" name="SWF5"/>
          <bitfield caption="XDMAC Channel 6 Software Flush Request Bit" mask="0x00000040" name="SWF6"/>
          <bitfield caption="XDMAC Channel 7 Software Flush Request Bit" mask="0x00000080" name="SWF7"/>
          <bitfield caption="XDMAC Channel 8 Software Flush Request Bit" mask="0x00000100" name="SWF8"/>
          <bitfield caption="XDMAC Channel 9 Software Flush Request Bit" mask="0x00000200" name="SWF9"/>
          <bitfield caption="XDMAC Channel 10 Software Flush Request Bit" mask="0x00000400" name="SWF10"/>
          <bitfield caption="XDMAC Channel 11 Software Flush Request Bit" mask="0x00000800" name="SWF11"/>
          <bitfield caption="XDMAC Channel 12 Software Flush Request Bit" mask="0x00001000" name="SWF12"/>
          <bitfield caption="XDMAC Channel 13 Software Flush Request Bit" mask="0x00002000" name="SWF13"/>
          <bitfield caption="XDMAC Channel 14 Software Flush Request Bit" mask="0x00004000" name="SWF14"/>
          <bitfield caption="XDMAC Channel 15 Software Flush Request Bit" mask="0x00008000" name="SWF15"/>
        </register>
